sohtamei/TuKuRutch.ext/libraries/esp32camlcd/SquareCam/src/src.ino
#define PCMODE

#define mVersion "SquareCam1.0"

#include "main.h"
#define RECV_BUFFER 65536

const lgfx::IFont* fontTbl[] = {
	NULL,						// 0:
	&fonts::Font0,				// 1:ascii8
	&fonts::Font2,				// 2:ascii16
	NULL,						// 3:
	&fonts::Font4,				// 4:ascii26
	NULL,						// 5:
	&fonts::Font6,				// 6:num48
	&fonts::Font7,				// 7:7seg48
	&fonts::Font8,				// 8:num75
	NULL,						// 9:

	&fonts::lgfxJapanGothic_12,		// 10:
	&fonts::lgfxJapanGothicP_12,	// 11:
	&fonts::lgfxJapanGothic_16,		// 12:
	&fonts::lgfxJapanGothicP_16,	// 13:
};

void _drawJpg(uint8_t* buf, int size) {
	if(!lcd || size<4) return;
	int x = GetL16(buf+0);
	int y = GetL16(buf+2);
	lcd->drawJpg(buf+4, size-4, x, y);
}

/*
	'ledcFrequency.ino'

	bits | min[Hz] | max[Hz]
	-----+---------+------------
	   1 |  19,532 | 20,039,138
	   2 |   9,766 | 10,019,569
	   3 |   4,883 |  5,009,784
	   4 |   2,442 |  2,504,892
	   5 |   1,221 |  1,252,446
	   6 |     611 |    626,223
	   7 |     306 |    313,111
	   8 |     153 |    156,555
	   9 |      77 |     78,277
	  10 |      39 |     39,138
	  11 |      20 |     19,569
	  12 |      10 |      9,784
	  13 |       5 |      4,892
	  14 |       3 |      2,446
*/
#define P_STBY    45

#define PWM_FREQ  50//10000
#define PWM_BITS  12//8
static uint8_t _pwm_bits = PWM_BITS;
const struct {uint8_t ledc; uint8_t port;} motorTable[4] = {
  {2,41},  // Left, Forward
  {3,38},  // Left, Backward
  {4, 2},  // Right, Forward
  {5, 1}}; // Right, Backward

int16_t _speed[2] = {0,0};
void _setMotor(uint8_t index, int16_t speed)
{
  if(index >= 2) return;
  _speed[index] = speed;
  digitalWrite(P_STBY, (_speed[0]==0 && _speed[1]==0) ? 0: 1);

  uint32_t pwm = (speed<0) ? -speed: speed;
  pwm = (pwm * (1<<_pwm_bits)) / 100;
  if(pwm > (1<<_pwm_bits)-1) pwm = (1<<_pwm_bits)-1;

  if(speed > 0) {
    ledcWrite(motorTable[index*2+0].ledc, pwm);
    ledcWrite(motorTable[index*2+1].ledc, 0);
  } else if(speed < 0) {
    ledcWrite(motorTable[index*2+0].ledc, 0);
    ledcWrite(motorTable[index*2+1].ledc, pwm);
  } else {
    ledcWrite(motorTable[index*2+0].ledc, 0);
    ledcWrite(motorTable[index*2+1].ledc, 0);
  }
}

struct { int16_t L; int16_t R;} static const dir_table[7] = {
//  L   R
  { 0,  0},  // 0:STOP
  { 1,  1},  // 1:FORWARD
  { 0,  1},  // 2:LEFT
  { 1,  0},  // 3:RIGHT
  {-1, -1},  // 4:BACK
  {-1,  1},  // 5:ROLL_LEFT
  { 1, -1},  // 6:ROLL_RIGHT
};

void _setCar(uint8_t direction, int16_t speed, int16_t duration)
{
  if(direction >= 7) return;
  _setMotor(0, speed * dir_table[direction].L);
  _setMotor(1, speed * dir_table[direction].R);

  if(duration) {
    delay(duration);
    _setMotor(0, 0);
    _setMotor(1, 0);
 }
}

void _setPwmFreq(int16_t pwm_freq, uint8_t pwm_bits)
{
  digitalWrite(P_STBY, 0);
  pinMode(P_STBY, OUTPUT);
  for(int i = 0; i < 4; i++) {
    if(ledcSetup(motorTable[i].ledc, pwm_freq/*Hz*/, pwm_bits/*bit*/)) {
      if(i==0) _pwm_bits = pwm_bits;
    } else {
      if(i==0) Serial.println("error");
    }
    ledcAttachPin(motorTable[i].port, motorTable[i].ledc);
    ledcWrite(motorTable[i].ledc, 0);
  }
}

#include <Wire.h>

#if defined(__AVR_ATmega328P__)
  #include <avr/wdt.h>

#elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
  #include <BLEPeripheral.h>
  static BLEPeripheral blePeripheral = BLEPeripheral();
#elif defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
  #include <Adafruit_TinyUSB.h>
  #include <MIDI.h>
  Adafruit_USBD_MIDI usb_midi;
  MIDI_CREATE_INSTANCE(Adafruit_USBD_MIDI, usb_midi, MIDI);
#endif

#define _Serial Serial

#include <Adafruit_NeoPixel.h>

enum {
RSP_BYTE    = 1,
RSP_SHORT   = 2,
RSP_LONG    = 3,
RSP_FLOAT   = 4,
RSP_DOUBLE  = 5,
RSP_STRING  = 6,
RSP_BUF     = 7,
};

#define getBufLen(n) (buffer+4+offsetIdx[n]+1),*(buffer+4+offsetIdx[n]+0)  // 第1引数 *buf, 第2引数 size
#define getBufLen2(n) (buffer+5),(_packetLen-5)

#if defined(ESP32)
#if defined(CONFIG_IDF_TARGET_ESP32)
  #define LEDC_BUZZER   15
  #define LEDC_PWM_START 2
  #define LEDC_PWM_END   7
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  #define LEDC_BUZZER    7   // by hajimef
  #define LEDC_PWM_START 2
  #define LEDC_PWM_END   6
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  #define LEDC_BUZZER    7
  #define LEDC_PWM_START 2
  #define LEDC_PWM_END   6
#else
  #pragma message "unsupported device"
#endif
#endif

/*
 * LEDC Chan to Group/Channel/Timer Mapping (ESP32)
** ledc: 0  => Group: 0, Channel: 0, Timer: 0 //CameraWebServer
** ledc: 1  => Group: 0, Channel: 1, Timer: 0
** ledc: 2  => Group: 0, Channel: 2, Timer: 1 x
** ledc: 3  => Group: 0, Channel: 3, Timer: 1 x
** ledc: 4  => Group: 0, Channel: 4, Timer: 2 x
** ledc: 5  => Group: 0, Channel: 5, Timer: 2 x
** ledc: 6  => Group: 0, Channel: 6, Timer: 3 x
** ledc: 7  => Group: 0, Channel: 7, Timer: 3 x
** ledc: 8  => Group: 1, Channel: 0, Timer: 0 //lowSpeed(duration=20ms以下で設定できない)
** ledc: 9  => Group: 1, Channel: 1, Timer: 0
** ledc: 10 => Group: 1, Channel: 2, Timer: 1
** ledc: 11 => Group: 1, Channel: 3, Timer: 1
** ledc: 12 => Group: 1, Channel: 4, Timer: 2
** ledc: 13 => Group: 1, Channel: 5, Timer: 2
** ledc: 14 => Group: 1, Channel: 6, Timer: 3
** ledc: 15 => Group: 1, Channel: 7, Timer: 3 //buzzer
*/

void setup()
{
#if defined(__AVR_ATmega328P__)
  MCUSR = 0;
  wdt_disable();
#elif defined(ESP32)

#elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
  Serial.begin(19200);
  _bleSetup();
#elif defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
  MIDI.begin(MIDI_CHANNEL_OMNI);
  MIDI.setHandleSystemExclusive(handleSystemExclusive);
  for(int i = 0; i < 20 && !TinyUSBDevice.mounted(); i++)
    delay(100);
  MIDI.turnThruOff();
#endif

  _setup(mVersion);
  _setPwmFreq(PWM_FREQ, PWM_BITS);

  _Serial.println(F("PC mode: " mVersion));
}

#ifdef RECV_BUFFER
uint8_t buffer[RECV_BUFFER];  // 0xFF,0x55,len,cmd,
#else
uint8_t buffer[256];  // 0xFF,0x55,len,cmd,
#endif
static uint8_t* _packet_dp = buffer;
static uint16_t _packetLen = 4;

#if defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
  uint8_t EncBuffer[293];  // 256/7*8
  int EncSize = 0;
#endif

#define ARG_NUM  16
#define ITEM_NUM (sizeof(ArgTypesTbl)/sizeof(ArgTypesTbl[0]))
static uint8_t offsetIdx[ARG_NUM] = {0};
static const PROGMEM char ArgTypesTbl[][ARG_NUM] = {
  {},
  {},
  {'S','b',},
  {'B',},
  {'B',},
  {'S','S','F',},
  {'S','S',},
  {'s',},
  {'s',},
  {'s','S','S',},
  {'s','S','S','B',},
  {'S',},
  {'2',},
  {'B','S','S',},
  {'B','S',},
  {},
  {'S','B',},
};

enum {
    MODE_INVALID = 0,
    MODE_UART_,
    MODE_WS,
    MODE_BLE,
    MODE_MIDI,
};
uint8_t comMode = MODE_INVALID;

void _write(uint8_t* dp, int count)
{
#if defined(ESP32)
  if(comMode == MODE_WS) {
    _packet_dp = dp;
    _packetLen = count;
  } else
#elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
  if(comMode == MODE_BLE) {
    _packet_dp = dp;
    _packetLen = count;
  } else
#elif defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
  if(comMode == MODE_MIDI) {
    _packet_dp = dp;
    _packetLen = count;
  } else
#endif
  if(comMode == MODE_UART_) {
    _Serial.write(dp, count);
  }
}

void _println(const char* mes)
{
  _write((uint8_t*)mes, strlen(mes));
}

// sync with scratch-vm/src/extensions/scratch3_tukurutch/comlib.js
static const PROGMEM char ArgTypesTbl2[][ARG_NUM] = {
  {'B','B'},		// 0x81:wire_begin     (SDA, SCL)
  {'B','b'},		// 0x82:wire_write     (adrs, [DATA])          ret:0-OK
  {'B','b','B'},	// 0x83:wire_writeRead (adrs, [DATA], readNum) ret:[DATA]-OK, NULL-ERROR
  {'B','B'},		// 0x84:wire_read      (adrs, readNum)         ret:[DATA]-OK, NULL-ERROR
  {},				// 0x85:wire_scan      ()                      ret:[LIST]

  {'b'},			// 0x86:digiWrite      (LIST[port,data])
  {'B'},			// 0x87:digiRead       (port)                  ret:level
  {'B','S'},		// 0x88:anaRead        (port, count)           ret:level(int16)
  {'B','S','S'},	// 0x89:tone           (port,freq,ms)
  {'b'},			// 0x8a:setPwms        (LIST[port,data])
  {'B','b'},		// 0x8b:neoPixels      (port,LIST[rgb])
  {'S','B','b'},	// 0x8d:setPwmsDur     (duration,mode,LIST[port,data])
};
#define CMD_MIN   0x81
#define CMD_MAX  (CMD_MIN + sizeof(ArgTypesTbl2)/sizeof(ArgTypesTbl2[0]) - 1)

