sohtamei/TuKuRutch.ext/libraries/esp32camlcd/SquareCam/src/src.ino
// sync with scratch-vm/src/extensions/scratch3_tukurutch/comlib.js,
//           mBlock/src/extensions/ExtensionManager.as
static const PROGMEM char ArgTypesTbl3[][ARG_NUM] = {
  {},				// 0xFB:statusWifi     ()                      ret:status SSID ip
  {},				// 0xFC:scanWifi       ()                      ret:SSID1 SSID2 SSID3 ..
  {'s','s'},		// 0xFD:connectWifi    (ssid,pass)             ret:status

  {},				// 0xFE:getFwName      ()                      ret:FwName
  {},				// 0xFF:reset          ()                      ret:
};
#define CMD3_MIN   0xFB
#define CMD3_MAX  (CMD3_MIN + sizeof(ArgTypesTbl3)/sizeof(ArgTypesTbl3[0]) - 1)

#if defined(NRF51_SERIES) || defined(NRF52_SERIES)
  #include <SlowSoftWire.h>

  class _Wire {
    private:
      uint8_t softI2C;
      SlowSoftWire *softWire;

    public:
      _Wire() {
        softWire = NULL;
        softI2C = 0;
      }
      ~_Wire() {;}

      void begin() { 
        Wire.begin();
        softI2C = 0;
      }

      void begin(int sda, int scl) {
        if((sda == 20 && scl == 19) || (sda == 0 && scl == 0)) {
          Wire.begin();
          softI2C = 0;
        } else {
          if(softWire) delete softWire;
          softWire = new SlowSoftWire(sda, scl, true);
          softI2C = 1;
        }
      }

      void end() {
        if(softI2C == 0) Wire.end();
        else if(softWire) {
          delete softWire;
          softWire = NULL;
        }
      }

      void beginTransmission(int adrs) {
        if(softI2C == 0)  Wire.beginTransmission(adrs);
        else if(softWire) softWire->beginTransmission(adrs);
      }

      uint8_t endTransmission(void) {
        if(softI2C == 0)  return Wire.endTransmission();
        else if(softWire) return softWire->endTransmission();
      }

      uint8_t endTransmission(uint8_t flag) {
        if(softI2C == 0)  return Wire.endTransmission(flag);
        else if(softWire) return softWire->endTransmission(flag);
      }

      uint8_t requestFrom(int adrs, int num) {
        if(softI2C == 0)  return Wire.requestFrom(adrs, num);
        else if(softWire) return softWire->requestFrom(adrs, num);
      }

      size_t write(uint8_t data) {
        if(softI2C == 0)  return Wire.write(data);
        else if(softWire) return softWire->write(data);
      }

      size_t write(const uint8_t *buf, size_t num) {
        if(softI2C == 0)  return Wire.write(buf, num);
        else if(softWire) return softWire->write(buf, num);
      }

      int available(void) {
        if(softI2C == 0)  return Wire.available();
        else if(softWire) return softWire->available();
      }

      int read(void) {
        if(softI2C == 0)  return Wire.read();
        else if(softWire) return softWire->read();
      }
  };
  _Wire _Wire;
#else
  #define _Wire Wire
#endif

static void sendWireRead(int adrs, int num)
{
  _Wire.requestFrom(adrs, num);
  if(_Wire.available() < num) {
    callOK();
  } else {
    for(int i = 0; i < num; i++)
      buffer[i] = _Wire.read();
    sendBin(buffer, num);
  }
}

static void sendWireScan(void)
{
  int num = 0;
  int i;
  for(i = 0; i < 127; i++) {
    _Wire.beginTransmission(i);
    int ret = _Wire.endTransmission();
    if(!ret) buffer[num++] = i;
  }
  sendBin(buffer, num);
}

static void digiWrite(uint8_t* buf, int num)
{
  int i;
  for(i = 0; i < num; i+= 2) {
    pinMode(buf[i+0], OUTPUT);
    digitalWrite(buf[i+0], buf[i+1]);
  }
}

int _analogRead(uint8_t port, uint16_t count)
{
  pinMode(port, INPUT);
  if(count == 0) count = 1;
  int i;
  uint32_t sum = 0;
  for(i = 0; i < count; i++)
    sum += analogRead(port);

 #if defined(__AVR_ATmega328P__)
  return ((sum / count) * 625UL) / 128;		// 1024->5000
 #elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
  return ((sum / count) * 825UL) / 256;		// 1024->3300
 #elif defined(ESP32)
  return ((sum / count) * 825UL) / 1024;	// 4096->3300  by hajimef
 #else
  return ((sum / count) * 825UL) / 256;		// 1024->3300
 #endif
}

void _tone(uint8_t port, int16_t freq, int16_t ms)
{
#if defined(ESP32)
  ledcAttachPin(port, LEDC_BUZZER);
  ledcWriteTone(LEDC_BUZZER, freq);
  delay(ms);
  ledcWriteTone(LEDC_BUZZER, 0);
#elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
  ;
#else
  tone(port, freq, ms);
  delay(ms);
#endif
}

#if defined(ESP32)
static uint8_t ledc2port[LEDC_PWM_END+1] = {0};
static void _setPwm(uint8_t port, uint16_t data)
{
  int i;
  for(i = LEDC_PWM_START; i <= LEDC_PWM_END; i++) {
    if(ledc2port[i] == port+1) {
      ledcWrite(i, data);
      return;
    } else if(ledc2port[i] == 0) {
      ledc2port[i] = port+1;
      ledcSetup(i, 50/*Hz*/, 12/*bit*/);
      ledcAttachPin(port, i);
      ledcWrite(i, data);
      return;
    }
  }
}
#else
// 328P:3,5,6,9,10,11  8bit
// nRF51,nRF52:5と11除く、8bit、3chまで
// RP2040
  #define _setPwm(port, data) analogWrite(port, (data)>>4)
#endif

static void _setPwms(uint8_t* buf, int num)
{
  int i;
  for(i = 0; i < num; i += 3)
    _setPwm(buf[i+0], buf[i+1]|(buf[i+2]<<8));
}

static void _setPwmsDur(int16_t duration, uint8_t mode, uint8_t* buf, int num)
{
  #define PWM_NEUTRAL 307	// 1.5ms/20ms*4096 = 307.2

  int i;
  for(i = 0; i < num; i += 3)
    _setPwm(buf[i+0], buf[i+1]|(buf[i+2]<<8));

  if(duration) {
    delay(duration);

    uint16_t data = 0;
    switch(mode) {
    case 0: data = 0; break;
    case 1: data = PWM_NEUTRAL; break;
    }
    for(i = 0; i < num; i += 3)
      _setPwm(buf[i+0], data);
  }
}

Adafruit_NeoPixel* _pixels = NULL;
#if defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
#else
  Adafruit_NeoPixel _pixels_instance;
#endif

static void _initNeoPixel(uint8_t port, uint8_t num)
{
  #if defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
    _pixels = new Adafruit_NeoPixel(num/*num*/, port/*pin*/, NEO_GRB + NEO_KHZ800);
    _pixels->begin();
    _pixels->clear();
    _pixels->clear();
  #else
    _pixels = &_pixels_instance;
    _pixels->updateType(NEO_GRB + NEO_KHZ800);
    _pixels->updateLength(num);
    _pixels->setPin(port);
    _pixels->begin();
  #endif
}

void _neoPixels(uint8_t port, uint8_t* buf, int num)
{
  num = num/3;
  if(!_pixels)
    _initNeoPixel(port, num);

