sohtamei/TuKuRutch.ext/libraries/esp32camlcd/SquareCam/src/src.ino
  for(int i = 0; i < num; i++)
    _pixels->setPixelColor(i, buf[i*3+0], buf[i*3+1], buf[i*3+2]);
  _pixels->show();
}

void _neoPixels(uint8_t port, int num, int color)
{
  if(!_pixels)
    _initNeoPixel(port, num);

  for(int i = 0; i < num; i++)
    _pixels->setPixelColor(i, color);
  _pixels->show();
}

static void parseData()
{
  uint8_t cmd;
  if(buffer[1] == 0x54) {
    cmd = buffer[4];
  } else if(buffer[1] == 0x55) {
  cmd = buffer[3];
  const PROGMEM char *ArgTypes = NULL;
  if(cmd < ITEM_NUM) {
     ArgTypes = ArgTypesTbl[cmd];

  } else if(cmd >= CMD_MIN && cmd <= CMD_MAX) {
     ArgTypes = ArgTypesTbl2[cmd-CMD_MIN];

  } else if(cmd >= CMD3_MIN && cmd <= CMD3_MAX) {
     ArgTypes = ArgTypesTbl3[cmd-CMD3_MIN];
  }

  uint8_t i;
  memset(offsetIdx, 0, sizeof(offsetIdx));
  if(ArgTypes) {
    uint16_t offset = 0;
    for(i = 0; i < ARG_NUM; i++) {
      uint8_t type = pgm_read_byte(ArgTypes+i);
      if(type == 0) break;
      offsetIdx[i] = offset;
      switch(type) {
      case 'B': offset += 1; break;
      case 'S': offset += 2; break;
      case 'L': offset += 4; break;
      case 'F': offset += 4; break;
      case 'D': offset += 8; break;
      case 's': offset += strlen((char*)buffer+4+offset)+1; break;
      case 'b': offset += buffer[4+offset]+1; break;
      default: break;
      }
      if(4+offset > _packetLen) return;
    }
  }
  }

  switch(cmd){
case 1: sendBin(buffer, _getLcdConfig(buffer)); break;
case 2: _setLcdConfig(getShort(0),getBufLen(1));/*_setupLCD(getShort(0),getBufLen(1));*/; callOK(); break;
case 3: if(lcd) lcd->setFont(fontTbl[getByte(0)]);; callOK(); break;
case 4: if(lcd) lcd->setRotation(getByte(0));; callOK(); break;
case 5: if(lcd) {lcd->setTextColor(getShort(0),getShort(1));lcd->setTextSize(getFloat(2));}; callOK(); break;
case 6: if(lcd) lcd->setCursor(getShort(0),getShort(1));; callOK(); break;
case 7: if(lcd) lcd->print(getString(0));; callOK(); break;
case 8: if(lcd) lcd->println(getString(0));; callOK(); break;
case 9: if(lcd) lcd->drawString(getString(0),getShort(1),getShort(2));; callOK(); break;
case 10: if(lcd) lcd->drawString(getString(0),getShort(1),getShort(2),fontTbl[getByte(3)]);; callOK(); break;
case 11: if(lcd) {lcd->fillScreen(getShort(0)); lcd->setCursor(0,0);}; callOK(); break;
case 12: _drawJpg(getBufLen2(0));; callOK(); break;
case 13: _setCar(getByte(0),getShort(1),getShort(2));; callOK(); break;
case 14: _setMotor(getByte(0),getShort(1));; callOK(); break;
case 15: _setCar(0,0,0);; callOK(); break;
case 16: _setPwmFreq(getShort(0),getByte(1));; callOK(); break;
#if defined(ESP32) || defined(NRF51_SERIES) || defined(NRF52_SERIES)
  case 0x81: _Wire.end(); _Wire.begin((int)getByte(0),(int)getByte(1)); callOK(); break;
#else
  case 0x81: _Wire.begin(); callOK(); break;
#endif
  case 0x82: _Wire.beginTransmission(getByte(0)); _Wire.write(getBufLen(1)); sendByte(_Wire.endTransmission()); break;
  case 0x83: _Wire.beginTransmission(getByte(0)); _Wire.write(getBufLen(1)); _Wire.endTransmission(false); sendWireRead(getByte(0),getByte(2)); break;
  case 0x84: sendWireRead(getByte(0),getByte(1)); break;
  case 0x85: sendWireScan(); break;

  case 0x86: digiWrite(getBufLen(0)); callOK(); break;
  case 0x87: pinMode(getByte(0),INPUT); sendByte(digitalRead(getByte(0))); break;
  case 0x88: sendShort(_analogRead(getByte(0),getShort(1)));break;
  case 0x89: _tone(getByte(0),getShort(1),getShort(2)); callOK(); break;
  case 0x8a: _setPwms(getBufLen(0)); callOK(); break;
  case 0x8b: _neoPixels(getByte(0),getBufLen(1)); callOK(); break;
  case 0x8d: _setPwmsDur(getShort(0),getByte(1),getBufLen(2)); callOK(); break;
#if defined(ESP32)
  // WiFi設定
  case 0xFB: sendString(statusWifi()); break;
  case 0xFC: sendString(scanWifi()); break;
  case 0xFD: sendByte(connectWifi(getString(0),getString(1))); break;
#endif
  case 0xFE:  // firmware name
    _println("PC mode: " mVersion "\r\n");
    break;

  case 0xFF:  // software reset
  #if defined(__AVR_ATmega328P__)
    wdt_enable(WDTO_15MS);
    while(1);
  #elif defined(ESP32)
    ESP.restart();
  #endif
    break;

    //### CUSTOMIZED ###
#ifdef REMOTE_ENABLE	// check remoconRoboLib.h or quadCrawlerRemocon.h
  #define CMD_CHECKREMOTEKEY  0x80
  case CMD_CHECKREMOTEKEY: sendRemote(); break;
#endif
  default: callOK(); break;
  }
}

int16_t _readUart(void)
{
  if(_Serial.available()>0) {
    comMode = MODE_UART_;
    return _Serial.read();
  }
  return -1;
}

static uint8_t blePeri_enable = false;
static uint16_t _index = 0;
void loop()
{
  int16_t c;
  while((c=_readUart()) >= 0) {
    //_Serial.printf("%02x",c);  // for debug
    buffer[_index++] = c;
    
    switch(_index) {
    case 1:
      _packetLen = 4;
      if(c != 0xff)
        _index = 0;
      break;
    case 2:
      if(c != 0x55 && c != 0x54)
        _index = 0;
      break;
    case 3:
      if(buffer[1] == 0x55) {
        _packetLen = 3+c;
      }
      break;
    case 4:
      if(buffer[1] == 0x54) {
        _packetLen = 4+buffer[2]+(c<<8);
      }
      break;
    }
    if(_index >= _packetLen) {
      parseData();
      _index = 0;
    }
    if(_index >= sizeof(buffer)) {
      _index = 0;
    }
  }

#if defined(ESP32)
  readWifi();
#elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
  if(blePeri_enable) blePeripheral.poll();
#elif defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)
  MIDI.read();
#endif

  loopWebSocket();
  _loop();

}

#if defined(ESP32)
uint8_t connected = 0;
static WebsocketsClient _client;

void onEventsCallback(WebsocketsEvent event, String data) {
  if(event == WebsocketsEvent::ConnectionOpened) {
    Serial.println("Connnection Opened");
  } else if(event == WebsocketsEvent::ConnectionClosed) {
    Serial.println("Connnection Closed");
    connected = 0;
  } else if(event == WebsocketsEvent::GotPing) {
    Serial.println("Got a Ping!");
  } else if(event == WebsocketsEvent::GotPong) {
    Serial.println("Got a Pong!");
  }
}

void onMessageCallback(WebsocketsMessage msg) {
  int size = msg.length();
  if(_index+size >= sizeof(buffer)) {
    _index = 0;
    return;
  }
  memcpy(buffer+_index, msg.c_str(), size);
  if(_index == 0) {
    if(buffer[0] != 0xff) {
      _index = 0;
      return;
    } else {
      switch(buffer[1]) {
      case 0x55:
        _packetLen = 3+buffer[2];
        break;
      case 0x54:
        _packetLen = 4+buffer[2]+(buffer[3]<<8);
        break;
      default:
        _index = 0;
        return;
      }
    }
  }
  comMode = MODE_WS;
  _index += size;
  if(_index >= _packetLen) {
    parseData();
    _client.sendBinary((char*)_packet_dp, _packetLen);
    _index = 0;
  } else {
    const uint8_t buf[] = {0x00};
    _client.sendBinary((char*)buf, sizeof(buf));
  }
}

