sohtamei/TuKuRutch.ext/libraries/esp32camlcd/SquareCam/src/src.ino
static void loopWebSocket(void)
{
  if(!wsServer.available()) return;
  if(wsServer.poll()) {
    connected = 1;
    _index = 0;
    Serial.println("connected");
    _client = wsServer.accept();
    _client.onMessage(onMessageCallback);
    _client.onEvent(onEventsCallback);
  }
  if(!connected || !_client.available()) return;
  _client.poll();
  return;
}
#elif defined(NRF51_SERIES) || defined(NRF52_SERIES)
static BLEDescriptor _nameDesc = BLEDescriptor("2901", mVersion);
static BLEService        _service = BLEService("6E400001-B5A3-F393-E0A9-E50E24DCCA9E");
static BLECharacteristic _rxChar  = BLECharacteristic("6E400002-B5A3-F393-E0A9-E50E24DCCA9E", BLEWrite|BLEWriteWithoutResponse, BLE_ATTRIBUTE_MAX_VALUE_LENGTH);
  // write/writeWoResp, both OK
static BLECharacteristic _txChar  = BLECharacteristic("6E400003-B5A3-F393-E0A9-E50E24DCCA9E", BLENotify|BLERead, BLE_ATTRIBUTE_MAX_VALUE_LENGTH);

void bleStop() {
    if(blePeri_enable) blePeripheral.end();
    blePeri_enable = false;
}

static void _bleSetup() {
  blePeripheral.setLocalName(mVersion);

  blePeripheral.addAttribute(_service);
  blePeripheral.addAttribute(_nameDesc);
  blePeripheral.setAdvertisedServiceUuid(_service.uuid());

  blePeripheral.addAttribute(_txChar);
  blePeripheral.addAttribute(_rxChar);
  _rxChar.setEventHandler(BLEWritten, _bleWritten);

  blePeripheral.setEventHandler(BLEConnected, _bleConnected);
  blePeripheral.setEventHandler(BLEDisconnected, _bleDisconnected);

  blePeripheral.begin();
  blePeri_enable = true;
}

static void _bleConnected(BLECentral& central) {
  _index = 0;
  Serial.println(F("Connected"));
}

static void _bleDisconnected(BLECentral& central) {
  Serial.println(F("Disconnected"));
}

static void _bleWritten(BLECentral& central, BLECharacteristic& _char) {
  //Serial.print(F("R:")); _dump(_rxChar.value(), _rxChar.valueLength());
  int size = _rxChar.valueLength();
  if(_index+size >= sizeof(buffer)) {
    _index = 0;
    return;
  }
  memcpy(buffer+_index, _rxChar.value(), size);
  if(_index == 0) {
    if(buffer[0] != 0xff) {
      _index = 0;
      return;
    } else {
      switch(buffer[1]) {
      case 0x55:
        _packetLen = 3+buffer[2];
        break;
      case 0x54:
        _packetLen = 4+buffer[2]+(buffer[3]<<8);
        break;
      default:
        _index = 0;
        return;
      }
    }
  }
  comMode = MODE_BLE;
  _index += size;
  if(_index >= _packetLen) {
    parseData();
    //Serial.print(F("W:")); _dump((uint8_t*)_packet_dp, _packetLen);
    _txChar.setValue(_packet_dp, _packetLen);
    _index = 0;
  } else {
    const uint8_t buf[] = {0x00};
    //Serial.print(F("W:")); _dump(buf, sizeof(buf));
    _txChar.setValue(buf, sizeof(buf));
  }
}
#elif defined (ARDUINO_ARCH_MBED_RP2040) || defined(ARDUINO_ARCH_RP2040)

void handleSystemExclusive(byte* buf, unsigned size) {
  comMode = MODE_MIDI;
  memcpy(EncBuffer+EncSize, buf, size);
  EncSize += size;
  if(buf[size-1] != 0xF7) return;

  if(_index+((size-2)*7)/8 >= sizeof(buffer)) {
    _index = 0;
    return;
  }
  size = midiDecdata(EncBuffer, EncSize, buffer+_index);
  EncSize = 0;
  if(_index == 0) {
    if(buffer[0] != 0xff) {
      _index = 0;
      return;
    } else {
      switch(buffer[1]) {
      case 0x55:
        _packetLen = 3+buffer[2];
        break;
      case 0x54:
        _packetLen = 4+buffer[2]+(buffer[3]<<8);
        break;
      default:
        _index = 0;
        return;
      }
    }
  }

  _index += size;
  if(_index >= _packetLen) {
    parseData();
    midiEncdata(_packet_dp, _packetLen);
    MIDI.sendSysEx(EncSize, EncBuffer/*, false*/);
    _index = 0;
    EncSize = 0;
  } else {
    const uint8_t buf[] = {0x00};
    MIDI.sendSysEx(sizeof(buf), buf/*, false*/);
  }
}

void midiEncdata(uint8_t* buf, int size)
{
  _dump(buf, size);  // debug
  EncSize = (size*8 + 6)/7;
  for(int i = 0; i < EncSize*7; i+=7) {
    int shift = i % 8;
    int offset = (i-shift)/8;
    int tmp2 = buf[offset];
    if(offset+1 < size) {
      tmp2 += buf[offset+1] << 8;
    }
    EncBuffer[i/7] = (tmp2 >> shift) & 0x7f;
  }
  //_dump(EncBuffer, EncSize);  // debug
  return;
}

int midiDecdata(uint8_t* buf, int size, uint8_t* plain)
{
  //_dump(buf, size);  // debug
  //if(buf[0] != 0xf0 && buf[size-1] != 0xf7) return;
    
  buf += 1;
  size -= 2;
  int plainSize = (size*7)/8;
  for(int i = 0; i < plainSize*8; i+=8) {
    int shift = i % 7;
    int offset = (i-shift)/7;
    int tmp2 = buf[offset];
    if(offset+1 < size) {
      tmp2 += buf[offset+1] << 7;
    }
    plain[i/8] = (tmp2 >> shift) & 0xff;
  }
  _dump(plain, plainSize);  // debug
  return plainSize;
}
#endif

int getCurPacket(uint8_t* buf, int size)
{
  if(_packetLen >= size) return 0;
  memcpy(buf, buffer, _packetLen);
  return _packetLen;
}

void playbackPackets(uint8_t* buf, int size)
{
  comMode = MODE_INVALID;
  int i;
  for(i = 0; i < size; ) {
    if(buf[i+0] != 0xff || buf[i+1] != 0x55) break;
    _packetLen = buf[i+2] + 3;
    memcpy(buffer, buf+i, _packetLen);
    parseData();
    delay(10);
    i += _packetLen;
  }
}

//*
static void _dump(const uint8_t* buf, int size)
{
  int i;
  char tmp[4];
  for(i = 0; i < size; i++) {
    snprintf(tmp, sizeof(tmp), "%02x", buf[i]);
    Serial.print(tmp);
  }
  Serial.println();
}
//*/

union floatConv { 
  float _float;
  uint8_t _byte[4];
} conv;

union doubleConv {
  double _double;
  uint8_t _byte[8];
};

uint8_t getByte(uint8_t n)
{
  return buffer[4+offsetIdx[n]];
}

int16_t getShort(uint8_t n)
{
  uint8_t x = 4+offsetIdx[n];
  return buffer[x+0]|((uint32_t)buffer[x+1]<<8);
}

int32_t getLong(uint8_t n)
{
  uint8_t x = 4+offsetIdx[n];
  return buffer[x+0]|((uint32_t)buffer[x+1]<<8)|((uint32_t)buffer[x+2]<<16)|((uint32_t)buffer[x+3]<<24);
}

float getFloat(uint8_t n)
{
  uint8_t x = 4+offsetIdx[n];
  union floatConv conv;
  for(uint8_t i=0; i<4; i++) {
    conv._byte[i] = buffer[x+i];
  }
  return conv._float;
}

double getDouble(uint8_t n)
{
  uint8_t x = 4+offsetIdx[n];
  union doubleConv conv;
  for(uint8_t i=0; i<8; i++) {
    conv._byte[i] = buffer[x+i];
  }
  return conv._double;
}

