sohtamei/TuKuRutch.ext/libraries/esp32camlcd/SquareCam/src/src.ino
char* getString(uint8_t n)
{
  uint8_t x = 4+offsetIdx[n];
  return (char*)buffer+x;
}

/*static*/ void callOK()
{
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = (uint8_t)0;
  _write(buffer, dp-buffer);
}

static void sendByte(uint8_t data)
{
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+sizeof(uint8_t);
  *dp++ = RSP_BYTE;
  *dp++ = data;
  _write(buffer, dp-buffer);
}

static void sendShort(uint16_t data)
{
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+sizeof(uint16_t);
  *dp++ = RSP_SHORT;
  *dp++ = data&0xff;
  *dp++ = data>>8;
  _write(buffer, dp-buffer);
}

static void sendLong(uint32_t data)
{
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+sizeof(uint32_t);
  *dp++ = RSP_LONG;
  *dp++ = data&0xff;
  *dp++ = data>>8;
  *dp++ = data>>16;
  *dp++ = data>>24;
  _write(buffer, dp-buffer);
}

static void sendFloat(float data)
{
  union floatConv conv;
  conv._float = data;
  
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+sizeof(float);
  *dp++ = RSP_FLOAT;
  *dp++ = conv._byte[0];
  *dp++ = conv._byte[1];
  *dp++ = conv._byte[2];
  *dp++ = conv._byte[3];
  _write(buffer, dp-buffer);
}

static void sendDouble(double data)
{
  union doubleConv conv;
  conv._double = data;
  
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+sizeof(double);
  *dp++ = RSP_DOUBLE;
  for(uint8_t i=0; i<8; i++) {
    *dp++ = conv._byte[i];
  }
  _write(buffer, dp-buffer);
}

static void sendString(String s)
{
  uint8_t l = s.length();
  
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+l;
  *dp++ = RSP_STRING;
  for(uint8_t i=0; i<l; i++) {
    *dp++ = s.charAt(i);
  }
  _write(buffer, dp-buffer);
}

void sendBin(uint8_t* buf, uint8_t num)
{
  memmove(buffer+5, buf, num);
  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 2+num;
  *dp++ = RSP_BUF;
  *dp++ = num;
  _write(buffer, 5+num);
}

void sendBin2(uint8_t* buf, uint16_t num)
{
      memmove(buffer+4, buf, num);
      uint8_t* dp = buffer;
      *dp++ = 0xff;
      *dp++ = 0x54;
      *dp++ = (num);
      *dp++ = (num)>>8;
      _write(buffer, 4+num);
}

//### CUSTOMIZED ###
#ifdef REMOTE_ENABLE	// check remoconRoboLib.h or quadCrawlerRemocon.h
static void sendRemote(void)
{
  uint16_t data;

  uint8_t* dp = buffer;
  *dp++ = 0xff;
  *dp++ = 0x55;
  *dp++ = 1+1+2+2;
  *dp++ = CMD_CHECKREMOTEKEY;
  *dp++ = remote.checkRemoteKey();
  data = remote.x; *dp++ = data&0xff; *dp++ = data>>8;
  data = remote.y; *dp++ = data&0xff; *dp++ = data>>8;
  _write(buffer, dp-buffer);
}
#endif
